integration/src/InformationRegisters/грИсторияОбработкиИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грИсторияОбработкиИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/InformationRegisters/грИсторияОбработкиИсходящихСообщений/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ИсточникСтрокой" Тогда		
		СсылкаДанных = ПолучитьСсылкуНаСервере(ВыбраннаяСтрока);
		Если НЕ СсылкаДанных = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(, СсылкаДанных);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	грИсторияОбработкиИсходящихСообщений.Источник КАК Источник
	               |ИЗ
	               |	РегистрСведений.грИсторияОбработкиИсходящихСообщений КАК грИсторияОбработкиИсходящихСообщений
	               |ГДЕ
	               |	грИсторияОбработкиИсходящихСообщений.ДатаВыгрузки = &ДатаВыгрузки
	               |	И грИсторияОбработкиИсходящихСообщений.ИдентификаторСообщения = &ИдентификаторСообщения
	               |	И грИсторияОбработкиИсходящихСообщений.ПорядковыйНомер = &ПорядковыйНомер";
	
	Для Каждого СтрокаСписка Из Строки Цикл
		Запрос.УстановитьПараметр("ДатаВыгрузки", СтрокаСписка.Ключ.ДатаВыгрузки);
		Запрос.УстановитьПараметр("ИдентификаторСообщения", СтрокаСписка.Ключ.ИдентификаторСообщения);
		Запрос.УстановитьПараметр("ПорядковыйНомер", СтрокаСписка.Ключ.ПорядковыйНомер);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ИсточникХранилища = Выборка.Источник.Получить();
			Если ЗначениеЗаполнено(ИсточникХранилища) Тогда
				Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ИсточникХранилища) Тогда
					СтрокаСписка.Значение.Данные.ИсточникСтрокой = ИсточникХранилища;
				Иначе
					СтрокаСписка.Значение.Данные.ИсточникСтрокой = ТипЗнч(ИсточникХранилища);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСсылкуНаСервере(КлючЗаписи)
	
	СсылкаДанных = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	грИсторияОбработкиИсходящихСообщений.Источник КАК Источник
	               |ИЗ
	               |	РегистрСведений.грИсторияОбработкиИсходящихСообщений КАК грИсторияОбработкиИсходящихСообщений
	               |ГДЕ
	               |	грИсторияОбработкиИсходящихСообщений.ДатаВыгрузки = &ДатаВыгрузки
	               |	И грИсторияОбработкиИсходящихСообщений.ИдентификаторСообщения = &ИдентификаторСообщения
	               |	И грИсторияОбработкиИсходящихСообщений.ПорядковыйНомер = &ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("ДатаВыгрузки", КлючЗаписи.ДатаВыгрузки);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", КлючЗаписи.ИдентификаторСообщения);
	Запрос.УстановитьПараметр("ПорядковыйНомер", КлючЗаписи.ПорядковыйНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИсточникХранилища = Выборка.Источник.Получить();
		Если ЗначениеЗаполнено(ИсточникХранилища) Тогда
			Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ИсточникХранилища) Тогда
				СсылкаДанных = ИсточникХранилища;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаДанных;
	
КонецФункции

#КонецОбласти
